docs/comp-sci/theorem-provers/mizar/example-defs-finite-groups.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-03-03 Thu 11:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Example Definitions Finite Groups - Mizar</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Example Definitions Finite Groups - Mizar</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-3514a396-c340-41d5-97f5-7fe965d4519c">1. Introduction</a></li>
<li><a href="#h-2e5a9e76-d90b-4603-ac16-2df78d4fc0a8">2. G Has Characteristic p</a></li>
<li><a href="#h-03074538-22a6-4bac-869b-a27c2bd4004c">3. Parabolic Subgroup</a></li>
<li><a href="#h-5ae83f58-ed1c-4543-8e5d-a49c61ba6701">4. Finite Group Theory</a>
<ul>
<li><a href="#h-86c68c5f-b76f-407c-aab0-aa4aecc6ceb9">4.1. Sections of a Group</a></li>
</ul>
</li>
<li><a href="#h-e5583d34-8606-4622-bc9a-3b915cb5eb4a">5. Subgroup Series</a>
<ul>
<li><a href="#h-4ecb1fc1-3d39-4555-8a61-3cf134915242">5.1. Central Series</a></li>
<li><a href="#h-193c557d-a853-468a-a56f-ba3d2dfcf3ba">5.2. Subnormal Series</a></li>
<li><a href="#h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df">5.3. Composition Series</a></li>
<li><a href="#h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467">5.4. Lower Central Series</a></li>
<li><a href="#h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89">5.5. Upper Central Series</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-3514a396-c340-41d5-97f5-7fe965d4519c" class="outline-2">
<h2 id="h-3514a396-c340-41d5-97f5-7fe965d4519c"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-h-3514a396-c340-41d5-97f5-7fe965d4519c">
<p>
This is a collection of definitions I intend to formalize in Mizar. The
hard part of the formalizations is the proof of existence and uniqueness
(or other correctness conditions).
</p>
</div>
</div>

<div id="outline-container-h-2e5a9e76-d90b-4603-ac16-2df78d4fc0a8" class="outline-2">
<h2 id="h-2e5a9e76-d90b-4603-ac16-2df78d4fc0a8"><span class="section-number-2">2</span> G Has Characteristic p</h2>
<div class="outline-text-2" id="text-h-2e5a9e76-d90b-4603-ac16-2df78d4fc0a8">
<p>
These definitions are taken from <a href="https://arxiv.org/abs/1906.07216">arXiv:1906.07216</a>.
</p>

<div class="definition" id="org32c9217">
<p>
Let \(p\) be a prime number, \(G\) be a finite group whose order is
divisible by \(p\). A <dfn>$p$-local subgroup</dfn> is one that looks like
\(N_{H}(P)\) where \(P\) is a nontrivial $p$-subgroup of \(G\).
</p>

</div>

<p>
My intuition is that this definition introduces an attribute "$p$-local"
for subgroups.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> p <span class="org-mizar-normal">be</span> prime Nat;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> finite Group <span class="org-mizar-normal">such</span> <span class="org-mizar-normal">that</span> p divides card G;
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> Subgroup <span class="org-mizar-normal">of</span> G;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> p-local <span class="org-mizar-normal">means</span>
  :Def:
  <span class="org-mizar-formula">ex</span> P <span class="org-mizar-formula">being</span> non trivial p-group Subgroup <span class="org-mizar-normal">of</span> G
  <span class="org-mizar-formula">st</span> the multMagma <span class="org-mizar-normal">of</span> IT = Normalizer P;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
Since subgroup equality is defined only for strict subgroups, we cannot
say <code>IT = Normalizer P</code> without making <code>IT</code> a strict Subgroup of G. (The
normalizer of a subgroup is defined to be a strict subgroup.) For this
reason, we needed to check <code>the multMagma of IT = Normalizer P</code>.
</p>

<div class="definition" id="org45073d6">
<p>
Let \(p\) be a prime number, \(G\) be a finite group, \(L\leq G\) be a subgroup.
We say \(L\) <dfn>has Characteristic \(p\)</dfn> if
\(C_{G}(O_{p}(L))\leq O_{p}(L)\).
</p>

</div>

<p>
This introduces a new predicate, <code>has_characteristic p</code> for a subgroup.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> p <span class="org-mizar-normal">be</span> prime Nat;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-skeleton">let</span> L <span class="org-mizar-normal">be</span> Subgroup <span class="org-mizar-normal">of</span> G;
  <span class="org-mizar-normal">pred</span> L has_characteristic p <span class="org-mizar-normal">means</span>
  :Def:
  Centralizer (p-core L) <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> (p-core L);
<span class="org-mizar-block">end</span>;
</pre>
</div>

<div class="definition" id="org7ab5a52">
<p>
Let \(p\) be a prime number, \(G\) be a finite group.
We say \(G\) <dfn>has local Characteristic \(p\)</dfn> if
if for all $p$-local subgroups \(L\) of \(G\) has characteristic \(p\).
</p>

</div>

<p>
(A special case when \(p = 2\), we just say that \(G\) has even
Characteristic.)
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> p <span class="org-mizar-normal">be</span> prime Nat;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> finite Group;
  <span class="org-mizar-normal">pred</span> G has_local_characteristic p <span class="org-mizar-normal">means</span>
  :Def:
  <span class="org-mizar-formula">for</span> L <span class="org-mizar-formula">being</span> Subgroup <span class="org-mizar-normal">of</span> G <span class="org-mizar-formula">st</span> L <span class="org-mizar-normal">is</span> p-local <span class="org-mizar-formula">holds</span> L has_characteristic p;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
From page ix of <a href="https://users.math.msu.edu/users/meierfra/Preprints/CGP/Structure/structure.pdf">The Local Structure Theorem For Finite Groups With A Large p-Subgroup</a>:
</p>

<div class="definition" id="orga9e27c6">
<p>
A finite group \(G\) has <dfn>characteristic \(p\)</dfn> if \(C_{G}(O_{p}(G))\leq O_{p}(G)\).
</p>

</div>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> p <span class="org-mizar-normal">be</span> prime Nat;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> finite Group;
  <span class="org-mizar-normal">pred</span> G has_characteristic p <span class="org-mizar-normal">means</span>
  :Def:
  Centralizer (p-core G) <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> (p-core G);
<span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-h-03074538-22a6-4bac-869b-a27c2bd4004c" class="outline-2">
<h2 id="h-03074538-22a6-4bac-869b-a27c2bd4004c"><span class="section-number-2">3</span> Parabolic Subgroup</h2>
<div class="outline-text-2" id="text-h-03074538-22a6-4bac-869b-a27c2bd4004c">
<div class="definition" id="orgb26550d">
<p>
Let \(G\) be a finite group.
Any subgroup of \(G\) containing a Sylow p-subgroup of \(G\) is a
<dfn>parabolic subgroup</dfn> of \(G\).
</p>

</div>

<p>
This defines an attribute "parabolic" for "Subgroup of \(G\)". We need to
use the Mizar predicate <a href="http://mizar.org/version/current/html/group_10.html#R3"><code>is_Sylow_p-subgroup_of_prime</code></a> to do the heavy lifting:
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> p <span class="org-mizar-normal">be</span> prime Nat;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> finite Group;
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> Subgroup <span class="org-mizar-normal">of</span> G;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> parabolic <span class="org-mizar-normal">means</span>
  :Def:
  <span class="org-mizar-formula">ex</span> P <span class="org-mizar-formula">being</span> Subgroup <span class="org-mizar-normal">of</span> G <span class="org-mizar-formula">st</span> P is_Sylow_p-subgroup_of_prime p <span class="org-mizar-formula">&amp;</span>
  P <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> IT;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<div class="definition" id="org7eaadbb">
<p>
Let \(p\) be a prime number, \(G\) be a finite group.
We say \(G\) has <dfn>parabolic characteristic \(p\)</dfn> if
every $p$-local parabolic subgroup of \(G\) has characteristic \(p\).
</p>

</div>

<p>
This defines a predicate (whenever a gadget "has <code>&lt;property&gt;</code>", it
defines a predicate).
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> p <span class="org-mizar-normal">be</span> prime Nat;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> finite Group;
  <span class="org-mizar-normal">pred</span> G has_parabolic_characteristic p <span class="org-mizar-normal">means</span>
  :Def:
  <span class="org-mizar-formula">for</span> H <span class="org-mizar-formula">being</span> parabolic Subgroup <span class="org-mizar-normal">of</span> G <span class="org-mizar-formula">st</span> H <span class="org-mizar-normal">is</span> p-local
  <span class="org-mizar-formula">holds</span> H has_characteristic p;
<span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-h-5ae83f58-ed1c-4543-8e5d-a49c61ba6701" class="outline-2">
<h2 id="h-5ae83f58-ed1c-4543-8e5d-a49c61ba6701"><span class="section-number-2">4</span> Finite Group Theory</h2>
<div class="outline-text-2" id="text-h-5ae83f58-ed1c-4543-8e5d-a49c61ba6701">
</div>
