comp-sci/theorem-provers/mizar/example-defs-finite-groups.org
** Sections of a Group
:PROPERTIES:
:CUSTOM_ID: h-86c68c5f-b76f-407c-aab0-aa4aecc6ceb9
:END:

Kurzweill and Stellmacher's /Theory of Finite Groups/ \S 1.3 concludes
with a brief definition in passing:

#+begin_definition
Let $G$ be a group, $N\trianglelefteq H\leq G$. We call the quotient
$H/N$ a {{{dfn(Section)}}} of $G$.
#+end_definition

In particular, $N$ is a normal subgroup of $H$ (viz., $N$ is not
necessarily a normal subgroup of $G$).

This appears to define a new mode (as hinted by "~<bork>~ of $G$").
*However* not all groups have a section (the quaternions famously do
not).

Consequently, we need to define this as a predicate.

#+begin_src mizar
definition
  let K,G be Group;
  pred K is_section_of G means :Def:
  ex H being Subgroup of G st
  ex N being normal Subgroup of N st
  K = H./.N;
end;
#+end_src

We also have a related notion "$G$ is involved in $K$" means $G$ is
isomorphic to a section of $K$. This is a transitive relation.

* Subgroup Series
:PROPERTIES:
:CUSTOM_ID: h-e5583d34-8606-4622-bc9a-3b915cb5eb4a
:END:

I will review the various subgroup series, and --- if they've been
already defined (implicitly or explicitly) --- their implementation.

** Central Series
:PROPERTIES:
:CUSTOM_ID: h-4ecb1fc1-3d39-4555-8a61-3cf134915242
:END:

The definition of a nilpotent group uses a central series
$G=Z_{1}\geq Z_{2}\geq\dots\geq Z_{n}=\mathbf{1}$ where
each $Z_{k}\trianglelefteq G$ and the quotient satisfies
$Z_{k}/Z_{k+1}\leq Z(G/Z_{k+1})$.

#+begin_src mizar
definition
  let IT be Group;
  attr IT is nilpotent means :Def2: :: GRNILP_1:def 2
  ex F being FinSequence of the_normal_subgroups_of IT st
  (len F > 0 & F.1 = (Omega).IT & F.(len F) = (1).IT &
   (for i being Element of NAT st i in dom F & i+1 in dom F
    for G1, G2 being strict normal Subgroup of IT
    st G1 = F.i & G2 = F.(i + 1)
    holds (G2 is Subgroup of G1 &
           G1./.((G1,G2)`*`) is Subgroup of
             center (IT./.G2))));
end; 
#+end_src

** Subnormal Series
:PROPERTIES:
:CUSTOM_ID: h-193c557d-a853-468a-a56f-ba3d2dfcf3ba
:END:

A solvable group is defined by having a subnormal series
$G=N_{1}\trianglerighteq N_{2}\trianglerighteq\dots\trianglerighteq N_{n}=\mathbf{1}$
--- that is, $N_{j+1}\trianglelefteq N_{j}$ for $j=0,\dots,n-1$ ---
whose factor groups $N_{k}/N_{k+1}$ are Abelian.

#+begin_src mizar
definition
  let IT be Group;
  attr IT is solvable means :Def1: :: GRSOLV_1:def 1
  ex F being FinSequence of Subgroups IT st
  (len F > 0 & F.1 = (Omega).IT & F.(len F) = (1).IT &
   (for i being Element of NAT st i in dom F & i+1 in dom F
    for G1, G2 being strict Subgroup of IT
    st G1 = F.i & G2 = F.(i+1)
    holds (G2 is strict normal Subgroup of G1 &
           (for N being normal Subgroup of G1 st N = G2
            holds G1 ./. N is commutative))));
end; 
#+end_src

** Composition Series
:PROPERTIES:
:CUSTOM_ID: h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df
:END:

A famous example of a subgroup series is the composition
series for a group. Mizar defines it as a subgroup series
$\mathbf{1}=A_{n}\trianglelefteq\dots\trianglelefteq A_{2}\trianglelefteq A_{1}=G$.
Although this seems to be using a strange convention, Mizar is following
Bourbaki's /Algbra/. The more familiar notion of a composition
series (as a ``maximal'' subnormal series) requires the
~jordan_holder~ attribute (again, this follows Bourbaki's
/Algebra/ Definition 10 in I.4.7).

#+begin_src mizar
:: ALG I.4.7 Definition 9
definition
  let O be set;
  let G be GroupWithOperators of O;
  let IT be FinSequence of the_stable_subgroups_of G;
  attr IT is composition_series means
  :: GROUP_9:def 28
  IT.1=(Omega).G & IT.(len IT)= (1).G &
  for i being Nat st i in dom IT & i+1 in dom IT
  for H1,H2 being StableSubgroup of G
  st H1=IT.i & H2=IT.(i+1)
  holds H2 is normal StableSubgroup of H1;
end;
#+end_src

