docs/comp-sci/theorem-provers/mizar/example-defs-finite-groups.html

<div id="outline-container-h-86c68c5f-b76f-407c-aab0-aa4aecc6ceb9" class="outline-3">
<h3 id="h-86c68c5f-b76f-407c-aab0-aa4aecc6ceb9"><span class="section-number-3">4.1</span> Sections of a Group</h3>
<div class="outline-text-3" id="text-h-86c68c5f-b76f-407c-aab0-aa4aecc6ceb9">
<p>
Kurzweill and Stellmacher's <i>Theory of Finite Groups</i> &sect; 1.3 concludes
with a brief definition in passing:
</p>

<div class="definition" id="org5030027">
<p>
Let \(G\) be a group, \(N\trianglelefteq H\leq G\). We call the quotient
\(H/N\) a <dfn>Section</dfn> of \(G\).
</p>

</div>

<p>
In particular, \(N\) is a normal subgroup of \(H\) (viz., \(N\) is not
necessarily a normal subgroup of \(G\)).
</p>

<p>
This appears to define a new mode (as hinted by "<code>&lt;bork&gt;</code> of \(G\)").
<b>However</b> not all groups have a section (the quaternions famously do
not).
</p>

<p>
Consequently, we need to define this as a predicate.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> K,G <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">pred</span> K is_section_of G <span class="org-mizar-normal">means</span> :Def:
  <span class="org-mizar-formula">ex</span> H <span class="org-mizar-formula">being</span> Subgroup <span class="org-mizar-normal">of</span> G <span class="org-mizar-formula">st</span>
  <span class="org-mizar-formula">ex</span> N <span class="org-mizar-formula">being</span> normal Subgroup <span class="org-mizar-normal">of</span> N <span class="org-mizar-formula">st</span>
  K = H./.N;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
We also have a related notion "\(G\) is involved in \(K\)" means \(G\) is
isomorphic to a section of \(K\). This is a transitive relation.
</p>
</div>
</div>
</div>

<div id="outline-container-h-e5583d34-8606-4622-bc9a-3b915cb5eb4a" class="outline-2">
<h2 id="h-e5583d34-8606-4622-bc9a-3b915cb5eb4a"><span class="section-number-2">5</span> Subgroup Series</h2>
<div class="outline-text-2" id="text-h-e5583d34-8606-4622-bc9a-3b915cb5eb4a">
<p>
I will review the various subgroup series, and &#x2014; if they've been
already defined (implicitly or explicitly) &#x2014; their implementation.
</p>
</div>

<div id="outline-container-h-4ecb1fc1-3d39-4555-8a61-3cf134915242" class="outline-3">
<h3 id="h-4ecb1fc1-3d39-4555-8a61-3cf134915242"><span class="section-number-3">5.1</span> Central Series</h3>
<div class="outline-text-3" id="text-h-4ecb1fc1-3d39-4555-8a61-3cf134915242">
<p>
The definition of a nilpotent group uses a central series
\(G=Z_{1}\geq Z_{2}\geq\dots\geq Z_{n}=\mathbf{1}\) where
each \(Z_{k}\trianglelefteq G\) and the quotient satisfies
\(Z_{k}/Z_{k+1}\leq Z(G/Z_{k+1})\).
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> nilpotent <span class="org-mizar-normal">means</span> :Def2: <span class="org-comment-delimiter">:: </span><span class="org-comment">GRNILP_1:def 2</span>
  <span class="org-mizar-formula">ex</span> F <span class="org-mizar-formula">being</span> FinSequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of IT <span class="org-mizar-formula">st</span>
  (len F &gt; 0 <span class="org-mizar-formula">&amp;</span> F.1 = (Omega).IT <span class="org-mizar-formula">&amp;</span> F.(len F) = (1).IT <span class="org-mizar-formula">&amp;</span>
   (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom F <span class="org-mizar-formula">&amp;</span> i+1 in dom F
    <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> IT
    <span class="org-mizar-formula">st</span> G1 = F.i <span class="org-mizar-formula">&amp;</span> G2 = F.(i + 1)
    <span class="org-mizar-formula">holds</span> (G2 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G1 <span class="org-mizar-formula">&amp;</span>
           G1./.((G1,G2)`*`) <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span>
             center (IT./.G2))));
<span class="org-mizar-block">end</span>; 
</pre>
</div>
</div>
</div>

<div id="outline-container-h-193c557d-a853-468a-a56f-ba3d2dfcf3ba" class="outline-3">
<h3 id="h-193c557d-a853-468a-a56f-ba3d2dfcf3ba"><span class="section-number-3">5.2</span> Subnormal Series</h3>
<div class="outline-text-3" id="text-h-193c557d-a853-468a-a56f-ba3d2dfcf3ba">
<p>
A solvable group is defined by having a subnormal series
\(G=N_{1}\trianglerighteq N_{2}\trianglerighteq\dots\trianglerighteq N_{n}=\mathbf{1}\)
&#x2014; that is, \(N_{j+1}\trianglelefteq N_{j}\) for \(j=0,\dots,n-1\) &#x2014;
whose factor groups \(N_{k}/N_{k+1}\) are Abelian.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> solvable <span class="org-mizar-normal">means</span> :Def1: <span class="org-comment-delimiter">:: </span><span class="org-comment">GRSOLV_1:def 1</span>
  <span class="org-mizar-formula">ex</span> F <span class="org-mizar-formula">being</span> FinSequence <span class="org-mizar-normal">of</span> Subgroups IT <span class="org-mizar-formula">st</span>
  (len F &gt; 0 <span class="org-mizar-formula">&amp;</span> F.1 = (Omega).IT <span class="org-mizar-formula">&amp;</span> F.(len F) = (1).IT <span class="org-mizar-formula">&amp;</span>
   (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom F <span class="org-mizar-formula">&amp;</span> i+1 in dom F
    <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict Subgroup <span class="org-mizar-normal">of</span> IT
    <span class="org-mizar-formula">st</span> G1 = F.i <span class="org-mizar-formula">&amp;</span> G2 = F.(i+1)
    <span class="org-mizar-formula">holds</span> (G2 <span class="org-mizar-normal">is</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G1 <span class="org-mizar-formula">&amp;</span>
           (<span class="org-mizar-formula">for</span> N <span class="org-mizar-formula">being</span> normal Subgroup <span class="org-mizar-normal">of</span> G1 <span class="org-mizar-formula">st</span> N = G2
            <span class="org-mizar-formula">holds</span> G1 ./. N <span class="org-mizar-normal">is</span> commutative))));
<span class="org-mizar-block">end</span>; 
</pre>
</div>
</div>
</div>

<div id="outline-container-h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df" class="outline-3">
<h3 id="h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df"><span class="section-number-3">5.3</span> Composition Series</h3>
<div class="outline-text-3" id="text-h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df">
<p>
A famous example of a subgroup series is the composition
series for a group. Mizar defines it as a subgroup series
\(\mathbf{1}=A_{n}\trianglelefteq\dots\trianglelefteq A_{2}\trianglelefteq A_{1}=G\).
Although this seems to be using a strange convention, Mizar is following
Bourbaki's <i>Algbra</i>. The more familiar notion of a composition
series (as a ``maximal'' subnormal series) requires the
<code>jordan_holder</code> attribute (again, this follows Bourbaki's
<i>Algebra</i> Definition 10 in I.4.7).
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-comment-delimiter">:: </span><span class="org-comment">ALG I.4.7 Definition 9</span>
<span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> O <span class="org-mizar-normal">be</span> set;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> GroupWithOperators <span class="org-mizar-normal">of</span> O;
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> FinSequence <span class="org-mizar-normal">of</span> the_stable_subgroups_of G;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> composition_series <span class="org-mizar-normal">means</span>
  <span class="org-comment-delimiter">:: </span><span class="org-comment">GROUP_9:def 28</span>
  IT.1=(Omega).G <span class="org-mizar-formula">&amp;</span> IT.(len IT)= (1).G <span class="org-mizar-formula">&amp;</span>
  <span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Nat <span class="org-mizar-formula">st</span> i in dom IT <span class="org-mizar-formula">&amp;</span> i+1 in dom IT
  <span class="org-mizar-formula">for</span> H1,H2 <span class="org-mizar-formula">being</span> StableSubgroup <span class="org-mizar-normal">of</span> G
  <span class="org-mizar-formula">st</span> H1=IT.i <span class="org-mizar-formula">&amp;</span> H2=IT.(i+1)
  <span class="org-mizar-formula">holds</span> H2 <span class="org-mizar-normal">is</span> normal StableSubgroup <span class="org-mizar-normal">of</span> H1;
<span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>
