docs/comp-sci/theorem-provers/mizar/example-defs-finite-groups.html

<div id="outline-container-h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467" class="outline-3">
<h3 id="h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467"><span class="section-number-3">5.4</span> Lower Central Series</h3>
<div class="outline-text-3" id="text-h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467">
<p>
The lower central series may be defined as
\(G=A_{1}\trianglerighteq A_{2}\trianglerighteq\dots\trianglerighteq A_{n}=\mathbf{1}\),
where \(A_{k+1}=[A_{k},G]=[G,A_{k}]\).
Mizar implicitly defines this in <code>GRNILP1:Th27</code>
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">theorem</span> <span class="org-comment-delimiter">:: </span><span class="org-comment">GRNILP_1:27</span>
  <span class="org-mizar-formula">for</span> G <span class="org-mizar-formula">being</span> Group
  <span class="org-mizar-formula">st</span> <span class="org-mizar-formula">ex</span> F <span class="org-mizar-formula">being</span> FinSequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G
     <span class="org-mizar-formula">st</span> len F &gt; 0 <span class="org-mizar-formula">&amp;</span> F.1 = (Omega).G <span class="org-mizar-formula">&amp;</span> F.(len F) = (1).G <span class="org-mizar-formula">&amp;</span>
     <span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">st</span> i in dom F <span class="org-mizar-formula">&amp;</span> i+1 in dom F
     <span class="org-mizar-formula">for</span> G1 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G <span class="org-mizar-formula">st</span> G1 = F.i
     <span class="org-mizar-formula">holds</span> [.G1, (Omega).G.] = F.(i+1)
  <span class="org-mizar-formula">holds</span> G <span class="org-mizar-normal">is</span> nilpotent
<span class="org-mizar-block">proof</span> <span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89" class="outline-3">
<h3 id="h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89"><span class="section-number-3">5.5</span> Upper Central Series</h3>
<div class="outline-text-3" id="text-h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89">
<p>
This is a subgroup series
\(Z^0(G) \leq Z^1(G) \leq Z^2(G) \leq \dots\),
where \(Z^{0}(G)=\mathbf{1}\),
\(Z^1(G) = Z(G)\),
\(Z^2(G)/Z^1(G) = Z(G/Z^1(G))\),
\(Z^3(G)/Z^2(G) = Z(G/Z^2(G))\), and so on. Each \(Z^{n}(G)\) is a normal
subgroup of \(G\).
</p>

<p>
In general, \(Z^{n+1}(G)/Z^{n}(G) = Z(G/Z^{n}(G))\) defines the \((n+1)\)
term in the series. Explicitly, we would have
</p>

<p>
\[ Z^{n+1}(G) = \{x\in G\mid \forall y\in G, [x,y]\in Z^{n}(G)\}. \]
</p>

<p>
We could thus propose the definition (based on modifying the definition
<code>GRNILP_1:def 2</code> to use <code>NAT_1</code> for <code>mode sequence of X is Function of NAT,X</code>):
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">func</span> UpperCentralSeries G -&gt; sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G <span class="org-mizar-normal">means</span>
  :Def:
  (<span class="org-mizar-normal">it</span>.0 = (1).G <span class="org-mizar-formula">&amp;</span>
   (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom <span class="org-mizar-normal">it</span> <span class="org-mizar-formula">&amp;</span> i+1 in dom <span class="org-mizar-normal">it</span>
    <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G
    <span class="org-mizar-formula">st</span> G1 = <span class="org-mizar-normal">it</span>.i <span class="org-mizar-formula">&amp;</span> G2 = <span class="org-mizar-normal">it</span>.(i + 1)
    <span class="org-mizar-formula">holds</span> (G1 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G2 <span class="org-mizar-formula">&amp;</span>
           G2./.((G2,G1)`*`) = center (G./.G1))));
  <span class="org-mizar-normal">existence</span>
  <span class="org-mizar-block">proof</span>
    <span class="org-mizar-skeleton">thus</span> <span class="org-mizar-formula">ex</span> Z <span class="org-mizar-formula">being</span> sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G <span class="org-mizar-formula">st</span>
     (Z.0 = (1).G <span class="org-mizar-formula">&amp;</span>
      (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom Z <span class="org-mizar-formula">&amp;</span> i+1 in dom Z
       <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G
       <span class="org-mizar-formula">st</span> G1 = Z.i <span class="org-mizar-formula">&amp;</span> G2 = Z.(i + 1)
       <span class="org-mizar-formula">holds</span> (G1 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G2 <span class="org-mizar-formula">&amp;</span>
              G2./.((G2,G1)`*`) = center (G./.G1))));
  <span class="org-mizar-block">end</span>;
  <span class="org-mizar-normal">uniqueness</span>
  <span class="org-mizar-block">proof</span>
    <span class="org-mizar-normal">defpred</span> P[sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G] <span class="org-mizar-normal">means</span>
    ($1.0 = (1).G <span class="org-mizar-formula">&amp;</span>
      (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom $1 <span class="org-mizar-formula">&amp;</span> i+1 in dom $1
       <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G
       <span class="org-mizar-formula">st</span> G1 = $1.i <span class="org-mizar-formula">&amp;</span> G2 = $1.(i + 1)
       <span class="org-mizar-formula">holds</span> (G1 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G2 <span class="org-mizar-formula">&amp;</span>
              G2./.((G2,G1)`*`) = center (G./.G1))));
    <span class="org-mizar-formula">for</span> Z1,Z2 <span class="org-mizar-formula">being</span> sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G <span class="org-mizar-formula">st</span>
    P[Z1] <span class="org-mizar-formula">&amp;</span> P[Z2] <span class="org-mizar-formula">holds</span> Z1=Z2;
    <span class="org-mizar-skeleton">hence</span> <span class="org-mizar-normal">thesis</span>;
  <span class="org-mizar-block">end</span>;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
We would then have to prove
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">theorem</span>
  <span class="org-mizar-formula">for</span> G <span class="org-mizar-normal">be</span> Group
  <span class="org-mizar-formula">for</span> n <span class="org-mizar-normal">be</span> Nat
  <span class="org-mizar-formula">holds</span> the carrier <span class="org-mizar-normal">of</span> (UpperCentralSeries G).(n+1) =
        {g <span class="org-mizar-normal">where</span> g <span class="org-mizar-normal">is</span> Element <span class="org-mizar-normal">of</span> G :
         <span class="org-mizar-formula">for</span> y <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> G
         <span class="org-mizar-formula">holds</span> [.g,y.] in (UpperCentralSeries G).n};
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-03-03 Thu 11:38.</p>
</div>
</body>
</html>